**Lab 1**

Using the dataset at https://bit.ly/2JIORnq
1. Assign it to a variable called users and use the 'user_id' as index
2. What is the age with least occurrence?
3. What is the mean age of users?
4. What is the most frequent occupation?

In [0]:
import pandas as pd
import numpy as np
user=pd.read_csv("https://bit.ly/2JIORnq", delimiter='|')
print(user)
count1 = user['age'].value_counts(ascending=True) 
#print(count1) 
print("\n \n \n Age with least occurrence")
print(count1.head(1))
print('\n \n \n  Mean age of users')
print(user.mean())
count2 = user['occupation'].value_counts() 
#print(count2) 
print('\n \n Most frequent occupation')
print(count2.head(1))

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]



 Age with least occurrence
7    1
Name: age, dtype: int64



  Mean age of users
user_id    472.000000
age         34.051962
dtype: float64


 Most frequent occupation
student    196
Name: occupation, dtype: int64

**Lab 2**

Dataset: https://bit.ly/2UUomN0
1. What is the price of each item?
2. What was the quantity of the most expensive item ordered?
3. How many times were a Veggie Salad Bowl ordered?
4. How many times people ordered more than one Canned Soda?

In [2]:
import pandas as pd
import numpy as np
user=pd.read_csv("https://bit.ly/2UUomN0", delimiter='\t')
#print(user[['item_name', 'item_price']] )
#print(user)
#expen = user['item_price'].value_counts() 
#print('\n \n \n Most expensive item')
#print(expen.head(1))
#user = user.DataFrame(np.random.random(200).reshape(2, 100))
user['item_price']=user['item_price'].map(lambda x: float(x.strip()[1:]))
user.sort_values(by=['item_price'],ascending=False)
expen = user['item_price'].value_counts() 
#z=user.sort_values("item_price", ascending=False)
print(user)
print('\n \n \n Most expensive item')
print(expen.head(1))

      order_id  ...  item_price
0            1  ...        2.39
1            1  ...        3.39
2            1  ...        3.39
3            1  ...        2.39
4            2  ...       16.98
...        ...  ...         ...
4617      1833  ...       11.75
4618      1833  ...       11.75
4619      1834  ...       11.25
4620      1834  ...        8.75
4621      1834  ...        8.75

[4622 rows x 5 columns]



 Most expensive item
8.75    730
Name: item_price, dtype: int64

**Lab 3**

Dataset: https://bit.ly/1N5br3h
1. Assign Columns for the dataset 
2. Is there any missing value in the dataframe?
3. delete the column class
4. set the values of the rows 10 to 29 of the column 'petal_length' to NaN
5. Delete the rows that have NaN
6. Reset the index so it begins with 0 again
7. BONUS: Create & Answer your own question
(Find the Second Most Frequent Element)

In [27]:
import pandas as pd
import numpy as np
user=pd.read_csv("https://bit.ly/1N5br3h", delimiter=',', names=['sepal_length','sepal_width','petal_length', 'petal_width', 'species'])
#user=pd.read_csv("https://bit.ly/1N5br3h", delimiter=',', names=['1','2','3'])
print(user)
print("\n \n \n \n Total Null Values Searched=")
print(user.isnull().sum().sum())
user1=user
print("\n \n \n Reulting Dataset After Deleting the coloum.........")
user1.drop(["species"], axis = 1, inplace = True)
print(user1)
print("\n \n \n Updating the Data from 10 to 29 Row to NAN")
for index in range(10,29): 
  user1.at[2:5,['petal_length']]=np.NaN
print(user1)
print("\n \n \n \n Total Null Values Searched=")
print(user1.isnull().sum().sum())
print('\n\n\n\n.........Delete the NaN Rows From Data set.....\n\n\n\n')
user2=user1.dropna()
print(user2)
print('\n\n\n\n.........Reset the index so it begins with 0 again.....\n\n\n\n')
user2=user2.reset_index(drop=True)
print(user2)
#List = user.sepal_l#ength
#user['species'].value_counts().argmax()

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]




 Total Null Values Searched=
0



 Reulting Dataset After Deleting the coloum.........
     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]



 Updating the Data from 10 to 29 Row to NAN
     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           NaN          0.2
3             4.6          3.1           NaN          0.2
4             5.0          3.6           NaN          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]




 Total Null Values Searched=
4




.........Delete the NaN Rows From Data set.....




     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
6             4.6          3.4           1.4          0.3
7             5.0          3.4           1.5          0.2
8             4.4          2.9           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[146 rows x 4 columns]




.........Reset the index so it begins with 0 again.....




     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.6          3.4           1.4          0.3
3             5.0          3.4           1.5          0.2
4             4.4          2.9           1.4          0.2
..            ...          ...           ...          ...
141           6.7          3.0           5.2          2.3
142           6.3          2.5           5.0          1.9
143           6.5          3.0           5.2          2.0
144           6.2          3.4           5.4          2.3
145           5.9          3.0           5.1          1.8

[146 rows x 4 columns]

**Lab 4**

DataSet: https://bit.ly/2CudMVh
1. Assign it to a variable called drinks.
2. Which continent drinks more beer on average?
3. For each continent print the statistics for wine consumption.
4. Display the mean alcohol consumption per continent for every column.
5. Display the median alcohol consumption per continent for every column.
6. Display the mean, min and max values for spirit consumption.

In [36]:
import pandas as pd
drinks = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv",sep=',' )
print(drinks)
drinks=drinks.head(60)
print(drinks)
more_avg_beer=drinks.groupby('continent').beer_servings.mean()
print(more_avg_beer)
more_avg_beer=more_avg_beer.head(1)
print(more_avg_beer)
drinks1=drinks.groupby('continent').wine_servings.mean()
print(drinks1)
drinks1=drinks.groupby('continent').total_litres_of_pure_alcohol.mean()
print(drinks1)
drinks1=drinks.groupby('continent').total_litres_of_pure_alcohol.median()
print(drinks1)
drinks1=drinks.spirit_servings.mean()
print(drinks1)
drinks1=drinks.spirit_servings.min(axis=0)
print(drinks1)
drinks1=drinks.spirit_servings.max(axis=0)
print(drinks1)

         country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0    Afghanistan              0  ...                           0.0         AS
1        Albania             89  ...                           4.9         EU
2        Algeria             25  ...                           0.7         AF
3        Andorra            245  ...                          12.4         EU
4         Angola            217  ...                           5.9         AF
..           ...            ...  ...                           ...        ...
188    Venezuela            333  ...                           7.7         SA
189      Vietnam            111  ...                           2.0         AS
190        Yemen              6  ...                           0.1         AS
191       Zambia             32  ...                           2.5         AF
192     Zimbabwe             64  ...                           4.7         AF

[193 rows x 6 columns]
                     country  ...  continent
0                Afghanistan  ...         AS
1                    Albania  ...         EU
2                    Algeria  ...         AF
3                    Andorra  ...         EU
4                     Angola  ...         AF
5          Antigua & Barbuda  ...        NaN
6                  Argentina  ...         SA
7                    Armenia  ...         EU
8                  Australia  ...         OC
9                    Austria  ...         EU
10                Azerbaijan  ...         EU
11                   Bahamas  ...        NaN
12                   Bahrain  ...         AS
13                Bangladesh  ...         AS
14                  Barbados  ...        NaN
15                   Belarus  ...         EU
16                   Belgium  ...         EU
17                    Belize  ...        NaN
18                     Benin  ...         AF
19                    Bhutan  ...         AS
20                   Bolivia  ...         SA
21        Bosnia-Herzegovina  ...         EU
22                  Botswana  ...         AF
23                    Brazil  ...         SA
24                    Brunei  ...         AS
25                  Bulgaria  ...         EU
26              Burkina Faso  ...         AF
27                   Burundi  ...         AF
28             Cote d'Ivoire  ...         AF
29                Cabo Verde  ...         AF
30                  Cambodia  ...         AS
31                  Cameroon  ...         AF
32                    Canada  ...        NaN
33  Central African Republic  ...         AF
34                      Chad  ...         AF
35                     Chile  ...         SA
36                     China  ...         AS
37                  Colombia  ...         SA
38                   Comoros  ...         AF
39                     Congo  ...         AF
40              Cook Islands  ...         OC
41                Costa Rica  ...        NaN
42                   Croatia  ...         EU
43                      Cuba  ...        NaN
44                    Cyprus  ...         EU
45            Czech Republic  ...         EU
46               North Korea  ...         AS
47                  DR Congo  ...         AF
48                   Denmark  ...         EU
49                  Djibouti  ...         AF
50                  Dominica  ...        NaN
51        Dominican Republic  ...        NaN
52                   Ecuador  ...         SA
53                     Egypt  ...         AF
54               El Salvador  ...        NaN
55         Equatorial Guinea  ...         AF
56                   Eritrea  ...         AF
57                   Estonia  ...         EU
58                  Ethiopia  ...         AF
59                      Fiji  ...         OC

[60 rows x 6 columns]
continent
AF     62.210526
AS     29.000000
EU    187.857143
OC    112.666667
SA    176.000000
Name: beer_servings, dtype: float64
continent
AF    62.210526
Name: beer_servings, dtype: float64
continent
AF     20.578947
AS      2.125000
EU    126.214286
OC     95.666667
SA     70.500000
Name: wine_servings, dtype: float64
continent
AF    2.742105
AS    1.275000
EU    8.714286
OC    6.100000
SA    5.883333
Name: total_litres_of_pure_alcohol, dtype: float64
continent
AF    1.80
AS    0.50
EU    9.95
OC    5.90
SA    5.70
Name: total_litres_of_pure_alcohol, dtype: float64
82.78333333333333
0
373